# __PyMySQL__
<hr>

## Import Libraries

In [6]:
import pandas as pd
from sqlalchemy import create_engine

## Create Connection

In [8]:
engine=create_engine('mysql+mysqlconnector://root:Enterprise1@localhost/sakila')

## Full Table

In [11]:
query= '''
show full tables;
'''
pd.read_sql_query(query,engine)

              Tables_in_sakila  Table_type
0                        actor  BASE TABLE
1                   actor_info        VIEW
2                      address  BASE TABLE
3                     category  BASE TABLE
4                         city  BASE TABLE
5                      country  BASE TABLE
6                     customer  BASE TABLE
7                customer_list        VIEW
8                         film  BASE TABLE
9                   film_actor  BASE TABLE
10               film_category  BASE TABLE
11                   film_list        VIEW
12                   film_text  BASE TABLE
13                   inventory  BASE TABLE
14                    language  BASE TABLE
15  nicer_but_slower_film_list        VIEW
16                     payment  BASE TABLE
17                      rental  BASE TABLE
18      sales_by_film_category        VIEW
19              sales_by_store        VIEW
20                       staff  BASE TABLE
21                  staff_list        VIEW
22                       store  BASE TABLE

## 1. Tampilkan daftar 10 film komedi dengan durasi tersingkat. Urutkan data berdasarkan film dengan urasi terpendek. Kolom yang diwajibkan tampil adalah title, category dan length.

In [ ]:
# Pertama kita perlu mencari dari tabel mana yang kira2 bersangkutan dengan hasil yang kita inginkan, berdasarkan kriteria bisa direka bahwa kita bisa ambil dari tabel film, film_category, dan category

In [22]:
query= '''
select *
from film
limit 1;
'''
pd.read_sql_query(query,engine) # kemudian kita buka tiap tabel dan cukup liat dari 1 baris saja. Bisa dilihat kita bisa mendapatkan info title dan durasi dari sini

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"{Behind the Scenes, Deleted Scenes}",2006-02-15 05:03:42

In [14]:
query= '''
select *
from category
limit 1;
'''
pd.read_sql_query(query,engine) # lalu kita buka dari category dan kita mendapatkan bahwa tiap genre film dinomori oleh category_id

   category_id    name         last_update
0            1  Action 2006-02-15 04:46:27

In [13]:
query= '''
select *
from film_category
limit 1;
'''
pd.read_sql_query(query,engine) # lalu kita buka dari film_category dan kita mendapatkan bahwa di tiap film_id, genre film dicocokkan dengan nomor category_id untuk genre yang cocok. maka kita baru bisa untuk memanggil genre itu dengan sql

   film_id  category_id         last_update
0        1            6 2006-02-15 05:07:09

In [27]:
query= '''
select f.title as title, c.name as category, f.length as durasi                             
from film f, film_category fc, category c
WHERE (c.name = 'Comedy') AND (fc.film_id = f.film_id) AND (c.category_id = fc.category_id)
ORDER BY durasi
limit 10;
'''
pd.read_sql_query(query,engine)
# pertama kita pilih category yang diperlukan dari tabel yang kita temukan dan kita namakan sesuai output yang diminta.

# kemudian kita tentukan dan memberi label dari sumber yang kita telah tentukan menjadi huruf pendek agar referensi sumber lebih mudah.

# Lalu kita kondisikan dimana kita hanya ingin mencari category comedy menggunakan WHERE yang dimana film_id dan category_id yang bersinggungan dari 3 sumber yang kita ambil. kita samakan nama kolom yang sama dari tabel referensi yang berbeda.

# karena kita diminta untuk mengurutkan berdasarkan durasi, kita order by durasi.

# dan kita tampilkan tidak lebih dari 10 dengan limit.

              title category  durasi
0   DOWNHILL ENOUGH   Comedy      47
1  PARADISE SABRINA   Comedy      48
2    HEAVEN FREEDOM   Comedy      48
3  HURRICANE AFFAIR   Comedy      49
4        LION UNCUT   Comedy      50
5         ZORRO ARK   Comedy      50
6       CLOSER BANG   Comedy      58
7   AIRPLANE SIERRA   Comedy      62
8   LONELY ELEPHANT   Comedy      67
9      DOOM DANCING   Comedy      68

## 2. Tampilkan daftar lengkap kategori film beserta jumlah film tiap kategori & rata-rata harga sewa DVD film tiap kategori. Urutkan data dari kategori dengan jumlah film terbanyak. Kolom yang diwajibkan ada minimal adalah kategori, jumlah film dan rata-rata harga sewa.

In [ ]:
# Pertama kita perlu mencari dari tabel mana yang kira2 bersangkutan dengan hasil yang kita inginkan, berdasarkan kriteria bisa direka bahwa kita bisa ambil dari tabel film, film_category, dan category

In [33]:
query= '''
select *
from film
limit 1;
'''
pd.read_sql_query(query,engine) # kemudian kita buka tiap tabel dan cukup liat dari 1 baris saja. Bisa dilihat kita bisa mendapatkan info rental rate dari sini

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"{Behind the Scenes, Deleted Scenes}",2006-02-15 05:03:42

In [34]:
query= '''
select *
from category
limit 1;
'''
pd.read_sql_query(query,engine)  # lalu kita buka dari category dan kita mendapatkan bahwa tiap genre film dinomori oleh category_id disini kita bisa menemukan nama genre berdasarkan category_id nya

   category_id    name         last_update
0            1  Action 2006-02-15 04:46:27

In [35]:
query= '''
select *
from film_category
limit 1;
'''
pd.read_sql_query(query,engine) # lalu kita buka dari film_category dan kita mendapatkan bahwa di tiap film_id, genre film dicocokkan dengan nomor category_id untuk genre yang cocok. maka kita baru bisa untuk memanggil genre itu dengan sql

   film_id  category_id         last_update
0        1            6 2006-02-15 05:07:09

In [43]:
query= '''
select c.name as kategori, COUNT(c.name) as jumlahMovie, AVG(f.rental_rate) as rataHargaSewa
from category c, film_category fc, film f
WHERE (fc.film_id = f.film_id) AND (c.category_id = fc.category_id)
group by kategori
order by jumlahMovie desc;
'''
pd.read_sql_query(query,engine)
# pertama kita pilih category yang diperlukan dari tabel yang kita temukan dan kita namakan sesuai output yang diminta dimana kita tentukan bahwa kolom nama di category sebagai nama, kemudian kita hitung jumlah tiap genre di kategori dengan count, dan kita cari jumlah rata-rata harga rental dengan AVG

# kemudian kita tentukan dan memberi label dari sumber yang kita telah tentukan menjadi huruf pendek agar referensi sumber lebih mudah.

# Lalu kita kondisikan dimana kita hanya ingin mencari menggunakan WHERE yang dimana film_id dan category_id yang bersinggungan dari 3 sumber yang kita ambil. kita samakan nama kolom yang sama dari tabel referensi yang berbeda.

# kita group by dengan kategori karena sifat datanya categorical, dan karena kita diminta untuk mengurutkan berdasarkan jumlahMovie dari yang paling banyak di contoh, maka kita order by jumlahMovie descending.

       kategori  jumlahMovie  rataHargaSewa
0        Sports           74       3.125135
1       Foreign           73       3.099589
2        Family           69       2.758116
3   Documentary           68       2.666471
4     Animation           66       2.808182
5        Action           64       2.646250
6           New           63       3.116984
7         Drama           62       3.022258
8         Games           61       3.252295
9        Sci-Fi           61       3.219508
10     Children           60       2.890000
11       Comedy           58       3.162414
12     Classics           57       2.744386
13       Travel           57       3.235614
14       Horror           56       3.025714
15        Music           51       2.950784

## 3. Tampilkan daftar 10 aktor/aktris yang paling banyak membintangi film. Kolom yang ditampilkan minimal: id aktor, nama depan, nama belakang dan jumlah film yang dibintangi. Kemudian urutkan dari aktor/aktris yang membintangi film terbanyak. Output yang diharapkan:

In [ ]:
# Pertama kita perlu mencari dari tabel mana yang kira2 bersangkutan dengan hasil yang kita inginkan, berdasarkan kriteria bisa direka bahwa kita bisa ambil dari tabel film, film_category, dan category

In [45]:
query= '''
select *
from actor
limit 1;
'''
pd.read_sql_query(query,engine) # kemudian kita buka tiap tabel dan cukup liat dari 1 baris saja. Bisa dilihat kita bisa mendapatkan info actor_id, nama depan dan belakang dari sini

   actor_id first_name last_name         last_update
0         1   PENELOPE   GUINESS 2006-02-15 04:34:33

In [47]:
query= '''
select *
from film_actor
limit 10;
'''
pd.read_sql_query(query,engine) # lalu kita buka dari film_actor dan buka max 10 baris dan kita mendapatkan bahwa tiap actor dinomori oleh category_id dan menunjukkan actor tersebut memainkan film apa saja berdasarkan film id nya.

   actor_id  film_id         last_update
0         1        1 2006-02-15 05:05:03
1         1       23 2006-02-15 05:05:03
2         1       25 2006-02-15 05:05:03
3         1      106 2006-02-15 05:05:03
4         1      140 2006-02-15 05:05:03
5         1      166 2006-02-15 05:05:03
6         1      277 2006-02-15 05:05:03
7         1      361 2006-02-15 05:05:03
8         1      438 2006-02-15 05:05:03
9         1      499 2006-02-15 05:05:03

In [48]:
query= '''
select *
from film
limit 1;
'''
pd.read_sql_query(query,engine) # lalu kita buka dari film dan kita mendapatkan bahwa di tiap film_id, terdapat info lebih rinci tentang film apa tersebut berdasarkan idnya. maka kita baru bisa untuk memanggil genre itu dengan sql

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"{Behind the Scenes, Deleted Scenes}",2006-02-15 05:03:42

In [56]:
query= '''
select a.actor_id as actor_id, a.first_name as first_name, a.last_name as last_name, COUNT(fa.film_id) as jumlahMovie
from actor a, film_actor fa, film f
where (a.actor_id = fa.actor_id) AND (fa.film_id = f.film_id)
GROUP BY actor_id
order by jumlahMovie desc
limit 10;
'''
pd.read_sql_query(query,engine)
# pertama kita pilih category yang diperlukan dari tabel yang kita temukan dan kita namakan sesuai output yang diminta dimana kita tentukan bahwa kolom actor id di actor sebagai actor_id, dan menamakan nama depan dan belakang kemudian kita hitung jumlah film yang mereka mainkan di berdasarkan film_id dengan count.

# kemudian kita tentukan dan memberi label dari sumber yang kita telah tentukan menjadi huruf pendek agar referensi sumber lebih mudah. berarti yang diambil disini adalah tabel actor, film actor dan film

# Lalu kita kondisikan dimana kita hanya ingin mencari menggunakan WHERE yang dimana actor_id dan film_id yang bersinggungan dari 3 sumber yang kita ambil. kita samakan nama kolom yang sama dari tabel referensi yang berbeda.

# kita group by dengan first_name karena sifat datanya categorical, dan karena kita diminta untuk mengurutkan berdasarkan jumlahMovie dari yang paling banyak di contoh, maka kita order by jumlahMovie descending.

   actor_id first_name  last_name  jumlahMovie
0       107       GINA  DEGENERES           42
1       102     WALTER       TORN           41
2       198       MARY     KEITEL           40
3       181    MATTHEW     CARREY           39
4        23     SANDRA     KILMER           37
5        81   SCARLETT      DAMON           36
6        37        VAL     BOLGER           35
7       158     VIVIEN   BASINGER           35
8       106    GROUCHO      DUNST           35
9        13        UMA       WOOD           35

## 4. Dari soal sebelumnya diketahui Gina Degeneres merupakan aktris yang paling banyak membintangi film, dengan total 42 judul film. Kategori film apakah yang paling banyak dibintanginya? Untuk mengetahuinya, tampilkan daftar kategori film beserta jumlah film yang pernah dibintangi oleh Gina Degeneres. Kolom yang diwajibkan ada yaitu kategori film dan jumlah film yang dibintangi. Output yang diharapkan:

In [ ]:
# Pertama kita perlu mencari dari tabel mana yang kira2 bersangkutan dengan hasil yang kita inginkan, berdasarkan kriteria bisa direka bahwa kita bisa ambil dari tabel actor, film_actor, film_category, dan category

In [64]:
query= '''
select *
from actor
where (first_name = 'GINA')
limit 10;
'''
pd.read_sql_query(query,engine) # pertama di kolom actor kita cari actor_id gina degeneres

   actor_id first_name  last_name         last_update
0       107       GINA  DEGENERES 2006-02-15 04:34:33

In [61]:
query= '''
select *
from film_actor
limit 10;
'''
pd.read_sql_query(query,engine) # lalu kita buka dari film_actor dan buka max 10 baris dan kita mendapatkan bahwa tiap actor dinomori oleh category_id dan menunjukkan actor tersebut memainkan film apa saja berdasarkan film id nya.

   actor_id  film_id         last_update
0         1        1 2006-02-15 05:05:03
1         1       23 2006-02-15 05:05:03
2         1       25 2006-02-15 05:05:03
3         1      106 2006-02-15 05:05:03
4         1      140 2006-02-15 05:05:03
5         1      166 2006-02-15 05:05:03
6         1      277 2006-02-15 05:05:03
7         1      361 2006-02-15 05:05:03
8         1      438 2006-02-15 05:05:03
9         1      499 2006-02-15 05:05:03

In [62]:
query= '''
select *
from film_category
limit 1;
'''
pd.read_sql_query(query,engine) # lalu kita buka dari film_category dan kita mendapatkan bahwa di tiap film_id, genre film dicocokkan dengan nomor category_id untuk genre yang cocok. maka kita baru bisa untuk memanggil genre itu dengan sql

   film_id  category_id         last_update
0        1            6 2006-02-15 05:07:09

In [65]:
query= '''
select *
from category
limit 1;
'''
pd.read_sql_query(query,engine)   # lalu kita buka dari category dan kita mendapatkan bahwa tiap genre film dinomori oleh category_id disini kita bisa menemukan nama genre berdasarkan category_id nya lalu kita tarik data dari sql

   category_id    name         last_update
0            1  Action 2006-02-15 04:46:27

In [67]:
query= '''
select c.name as category, COUNT(fa.film_id) as jumlahMovie
from actor a, film_actor fa, film_category fc, category c
where (a.actor_id = 107) AND (a.actor_id = fa.actor_id) AND (fa.film_id = fc.film_id) AND (fc.category_id = c.category_id)
GROUP BY category;
'''
pd.read_sql_query(query,engine)
# pertama kita tentukan tabel category dulu untuk nama kategorinya dan kita akan hitung semua category yang ia mainkan

# kemudian kita tentukan dan memberi label dari sumber yang kita telah tentukan menjadi huruf pendek agar referensi sumber lebih mudah. berarti yang diambil disini adalah tabel actor, film actor dan film

# Lalu kita kondisikan dimana kita hanya ingin mencari menggunakan WHERE yang dimana pertama actor_id harus sesuai dengan actor_id gina degeners yaitu 107. lalu actor_id, category_id dan film_id yang bersinggungan dari 4 sumber yang kita ambil. kita samakan nama kolom yang sama dari tabel referensi yang berbeda.

# kita group by dengan category karena sifat datanya categorical, dan kemudian selesai.

       category  jumlahMovie
0   Documentary            3
1       Foreign            2
2         Music            4
3           New            1
4        Sci-Fi            7
5        Action            3
6         Drama            2
7     Animation            4
8        Horror            1
9        Family            4
10       Comedy            3
11     Children            2
12     Classics            2
13       Sports            2
14        Games            1
15       Travel            1

## 5. Dari soal sebelumnya diketahui Gina Degeneres paling banyak membintangi film bergenre sciencefiction, dengan total 7 judul film. Tampilkan daftar judul film sci-fi yang pernah dibintangi oleh Gina Degeneres. Kolom yang diwajibkan ada yaitu judul film dan kategorinya. Output yang diharapkan:

In [69]:
query= '''
select *
from actor
where (first_name = 'GINA')
limit 10;
'''
pd.read_sql_query(query,engine) # pertama di kolom actor kita cari actor_id gina degeneres

   actor_id first_name  last_name         last_update
0       107       GINA  DEGENERES 2006-02-15 04:34:33

In [70]:
query= '''
select *
from film_actor
limit 10;
'''
pd.read_sql_query(query,engine) # lalu kita buka dari film_actor dan buka max 10 baris dan kita mendapatkan bahwa tiap actor dinomori oleh category_id dan menunjukkan actor tersebut memainkan film apa saja berdasarkan film id nya.

   actor_id  film_id         last_update
0         1        1 2006-02-15 05:05:03
1         1       23 2006-02-15 05:05:03
2         1       25 2006-02-15 05:05:03
3         1      106 2006-02-15 05:05:03
4         1      140 2006-02-15 05:05:03
5         1      166 2006-02-15 05:05:03
6         1      277 2006-02-15 05:05:03
7         1      361 2006-02-15 05:05:03
8         1      438 2006-02-15 05:05:03
9         1      499 2006-02-15 05:05:03

In [71]:
query= '''
select *
from film_category
limit 1;
'''
pd.read_sql_query(query,engine) # lalu kita buka dari film_category dan kita mendapatkan bahwa di tiap film_id, genre film dicocokkan dengan nomor category_id untuk genre yang cocok. maka kita baru bisa untuk memanggil genre itu dengan sql

   film_id  category_id         last_update
0        1            6 2006-02-15 05:07:09

In [75]:
query= '''
select *
from category
where (name = 'Sci-Fi')
limit 1;
'''
pd.read_sql_query(query,engine)   # lalu kita buka cari category_id sci-fi

   category_id    name         last_update
0           14  Sci-Fi 2006-02-15 04:46:27

In [73]:
query= '''
select *
from film
limit 1;
'''
pd.read_sql_query(query,engine) # dan buka dari film untuk mendapatkan title

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"{Behind the Scenes, Deleted Scenes}",2006-02-15 05:03:42

In [78]:
query= '''
select f.title as title, c.name as category
from actor a, film_actor fa, film_category fc, category c, film f
where (a.actor_id = 107) AND (c.category_id = 14) AND (a.actor_id = fa.actor_id) AND (fa.film_id = fc.film_id) AND (fc.category_id = c.category_id) AND (fa.film_id = f.film_id)
GROUP BY title;
'''
pd.read_sql_query(query,engine)
# pertama kita tentukan tabel category dulu untuk nama kategorinya dan kita akan hitung semua category yang ia mainkan

# kemudian kita tentukan dan memberi label dari sumber yang kita telah tentukan menjadi huruf pendek agar referensi sumber lebih mudah. berarti yang diambil disini adalah tabel actor, film actor, film category, category dan film

# Lalu kita kondisikan dimana kita hanya ingin mencari menggunakan WHERE yang dimana pertama actor_id harus sesuai dengan actor_id gina degeners yaitu 107, dan category_id dari category 14 untuk scifi lalu actor_id, category_id dan film_id dari yang bersinggungan dari 4 sumber yang kita ambil. kita samakan nama kolom yang sama dari tabel referensi yang berbeda.

# kita group by dengan title karena sifat datanya categorical, dan kemudian selesai.

                 title category
0  CHARIOTS CONSPIRACY   Sci-Fi
1  COLDBLOODED DARLING   Sci-Fi
2       FRISCO FORREST   Sci-Fi
3    GOODFELLAS SALUTE   Sci-Fi
4      LICENSE WEEKEND   Sci-Fi
5         OPEN AFRICAN   Sci-Fi
6  SPIRITED CASUALTIES   Sci-Fi